/*
    Напишіть невеличку гру, яка за допомогою браузерної команди prompt() буде запитувати користувача ввести будь-яке число. Далі потрібно перевірити:

    Якщо число більше або дорівнює 123 - програма зупиняється, виводячи текстове повідомлення Wow, you've ended this endless cycle!;
    Якщо введене число менше від 123 - вивести текстове Should continue та продовжувати запитувати користувача про введення далі;
    Якщо користувач ввів не числове значення - вивести текстове повідомлення Only numbers, please та знову запитувати ввести значення.
*/

/*
     1) Прибрав перетворення до числа перед кожним prompt(), так як дійсно краще один раз це зробити
        при перевірці на NaN, ніж кожного разу.
     2) Розбив один while на 2, щоб не ускладнювати умови циклу.
*/

{
    let answer = prompt('Enter some number');

    while (isNaN(+answer)) {
        answer = prompt('Only numbers, please');
    }
    while(answer < 123) {
        answer = prompt('Should continue');
    }

    alert("Wow, you've ended this endless cycle!");
}

/*
    №2 Сума та добуток діапазону чисел
    За допомогою браузерної команди prompt() почергово запросити у користувача 2 різних числа. В залежності від того, що ввів користувач:

    Якщо будь-яке введене значення не є числом - повторити запит на введення даних з текстом Only numbers, please;
    Якщо обидва значення числові - вивести добуток всіх парних чисел та суму всіх не парних чисел у заданому діапазоні.
    Діапазон - числа між значеннями, що їх ввів користувач, включаючи самі значення.
    Вивід відформатувати з використанням повідомлень Сума = {значення суми} та Добуток = {значення добутку}
    (фігурні дужки самі по собі не потрібні, тут лиш для відображення форматування).
 */

{
/*
    0.0) Виніс змінні на початок, щоб одразу було видно що буде присутнє у коді.
    0.1) Вирішив залишити перетворення до числа на етапі prompt(), так як в іншому випадку придеться це робити частіше.
    1) Можливо не зовсім вірно зрозумів комент: "Чи можливо аби запит на числа від користувача був у циклі?". В голові
        крутилося 2 варіани, або через for() {}, або просто додати первинний виклик prompt() у while(). Але виникла необхідність
        додатково робити перевірку, щоб виводити різні повідомлення при prompt(). Коротше мені здається, що я все ускладнив.
    2)  Тут теж не впевнений, що знайшов оптимальне рішення, хоча і з одною перевіркою на те, яке число менше.
        Виглядає більш об'ємно, але більш читаємо.
*/

    let number1;
    let number2;
    let startNumber;
    let finishNumber;
    let sum = 0;
    let mult = 1;

    while(isNaN(number1) || isNaN(number2)) {
        if (typeof number1 === 'undefined') {
            number1 = +prompt('Enter number 1');
        } else if (isNaN(number1)) {
            number1 = +prompt('Only numbers, please (number 1)');
        }

        if (typeof number2 === 'undefined') {
            number2 = +prompt('Enter number 2');
        } else if (isNaN(number2)) {
            number2 = +prompt('Only numbers, please (number 2)');
        }
    }

    if (number1 < number2) {
        startNumber = number1;
        finishNumber = number2 + 1;
    } else {
        startNumber = number2;
        finishNumber = number1 + 1;
    }

    for (let x = startNumber; x < finishNumber; x++) {
       if (x % 2 === 0) {
           mult = mult * x;
       } else {
           sum = sum + x;
       }
    }

    console.log(sum);
    console.log(mult);
}